# <center> Контрольное задание

In [114]:
import pandas as pd
import numpy as np

#### Task 1. 
Задание:

1. Создайте Series из последовательности 15 значений, равномерно разбивающих отрезок [0, 20] (воспользуйтесь функцией linspace)
2. Определите отношение элементов полученной серии к их предыдущим элементам (\*). 
3. В результате необходимо получить среднее полученного вектора, оставив в нём только те значения, которые не более чем 1.5 (\**). 

Выберите из ответов тот, который максимально близок к полученному (c точки зрения абсолютной разницы).

#### Варианты ответов:
    - 1) 1.24
    - 2) 1.18 
    - 3) 0.71
    - 4) 1.13


##### Пояснения:
(\*) Если было бы необходимо найти последовательность из 3-х значений,  
равномерно разбивающих отрезок [0,1], то это были бы значения [0, 0.5, 1]. 

(\**) Если был бы дан список элементов a = [1,2,3,12], отношения элементов к предыдущим будут равны [NaN, 2, 1.5, 4].  
А на последнем этапе в таком примере останется только [1.5] и среднее значение будет также 1.5.

In [113]:
### Type your code here
a = pd.Series(np.linspace(0,20, 15))
print(type(a))
a

<class 'pandas.core.series.Series'>

0      0.000000
1      1.428571
2      2.857143
3      4.285714
4      5.714286
5      7.142857
6      8.571429
7     10.000000
8     11.428571
9     12.857143
10    14.285714
11    15.714286
12    17.142857
13    18.571429
14    20.000000
dtype: float64

In [115]:
print("Отношение элементов в серии")
a = a.diff()
a

Отношение элементов в серии

0          NaN
1     1.428571
2     1.428571
3     1.428571
4     1.428571
5     1.428571
6     1.428571
7     1.428571
8     1.428571
9     1.428571
10    1.428571
11    1.428571
12    1.428571
13    1.428571
14    1.428571
dtype: float64

In [116]:
print("Среднее")
a.mean()

Среднее

np.float64(1.4285714285714286)

In [117]:
ans = [
1.24,
1.18,
0.71,
1.13
]
print("Максимально близкий элемент к среднему по серии")
print(min(((abs(a.mean()-i),i) for i in ans))[1])

Максимально близкий элемент к среднему по серии
1.24

### Task 2. 
Выберите все верные ответы касательно следующих 3-х Series:
- pd.Series('abcde'); (1) 
- pd.Series(['abcde']); (2) 
- pd.Series(list('abcde')); (3)
- pd.Series("abcde"); (4)
    
##### Пояснения:
- функция list: в строке каждый символ - это отдельный элемент для list
- квадратные скобки: в квадратных скобках списку передается множество элементов по отдельности через запятую


#### Вопросы:
    - 1) Серия (1) совпадает с серией (2), так как в каждом из случаев серия создаётся из списка строк
    - 2) Серия (2) совпадает с серией (3), так как в каждом из случаев серия создаётся из списка символов 
    - 3) Серия (1) не совпадает с серией (4), так как в (4) используются двойные кавычки "" вместо одинарных ''

In [119]:
# (1) = (q) (2) = (w) (3) = (e) (4) = (d)
print(q:=pd.Series('abcde')) 
print(w:=pd.Series(['abcde']))
print(e:=pd.Series(list('abcde')))
print(d:=pd.Series("abcde"))

0    abcde
dtype: object
0    abcde
dtype: object
0    a
1    b
2    c
3    d
4    e
dtype: object
0    abcde
dtype: object

In [122]:
print(q==w) # (1) == (2) 1) True
# print(w==e) # (2) == (3) 2) False, 3 это список букв
print(q==d) # (1) == (4) 2) False, т.к. строка это строка

0    True
dtype: bool
0    True
dtype: bool

#### Task 3. 

По клиенту получены зашумленные данные (объект s типа Series) по его транзакциям. 

Для заданного ниже объекта s проделайте следующее:
1. Создайте новый Series, значения которого совпадают со значениями s, а индексы - целочисленные значения от 2 до 12, не включая 12. 
2. Выберите из новой серии элементы с индексами 3 и 5, после чего просуммируйте их, сохранив результат (1). 
3. Выберите из s только целочисленные элементы и вычислите их дисперсию (2). (\*)

Все полученные результаты округлите до 2-х знаков после запятой.

#### Выберите все верные пункты:
    - 1) Ответ (1) - 642.52
    - 2) Ответ (1) - 91.78
    - 3) Ответ (1) - не может быть определён (укажите причину)
    - 4) Ответ (2) - 57591.19
    - 5) Ответ (2) - 210.12
    - 6) Ответ (2) - не может быть определён

##### Пояснения:
(\*) Целочисленные значения - значения, имеющие тип int.
- Дисперсия рассчитывается с помощью функции из библиотеки numpy: np.var( , ddof=0) или встроенной в python функции: .var(ddof=0)

In [120]:
s = pd.Series(data=['1', 2, 3.1, 'hi!', 5, -512, 12.42, 'sber', 10.10, 98], 
              index=range(6, 26, 2))

print(s)
### Type your code here
new_s = pd.Series(s.values, index=np.arange(2,12))
new_s

6         1
8         2
10      3.1
12      hi!
14        5
16     -512
18    12.42
20     sber
22     10.1
24       98
dtype: object

2         1
3         2
4       3.1
5       hi!
6         5
7      -512
8     12.42
9      sber
10     10.1
11       98
dtype: object

In [118]:
# three_five = new_s[3]+new_s[5]

In [121]:
np.var(list(filter(lambda x: isinstance(x, int), new_s)), ddof=0)

np.float64(57591.1875)

In [123]:
print("Правильные 3) и 4)")

Правильные 3) и 4)

#### Task 4. 
1. Сгенерируйте Series из 100 значений нормально распределённой СВ (np.random.normal с дефолтными параметрами - нулевым средним и единичной дисперсией).
2. Возведите каждое значение серии в 3 степень, а значения индекса увеличьте в 3 раза. 
3. Ответьте на следующие вопросы через запятую (без пробелов) (\*)
    - 1) Выведите сумму элементов, строго меньших 2.6, имеющих нечётные значения индекса. 
    - 2) Выведите количество значений серии меньше нуля.

#### Пояснения:
(\*) Если получились ответы 4.32 и 3, то необходимо вывести их в виде "4.32 , 3". То есть вещественные числа необходимо разделять точками. Не забудьте про фиксированный seed (его менять не нужно)!
 - Определенное значение seed нужно, чтобы ответы у всех выполняющих
это задание были одинаковые и их можно было проверить (так как генерируются
одинаковые series).
 - Следует внимательнее использовать [ ] для выбора данных по нескольким условиям:
либо выбирать данные последовательно, либо сразу по нескольким условиям,
но через оператор &. Отличие оператора and от оператора &: and - выводит
последнее проверенное значение, & - выводит пересечение значений.
Пример: s[ _  &  _ ].sum()

In [125]:

np.random.seed(242)

### Type your code here
task_4 = pd.Series(np.random.normal(0,1,100))
task_4

0    -0.357519
1     0.148448
2     0.993531
3     1.838968
4    -0.744026
        ...
95    0.950296
96    0.737315
97   -0.739985
98   -1.376260
99    0.052260
Length: 100, dtype: float64

In [126]:
task_4 **= 3
task_4.index *= 3
task_4

0     -0.045698
3      0.003271
6      0.980718
9      6.219024
12    -0.411874
         ...
285    0.858176
288    0.400829
291   -0.405199
294   -2.606764
297    0.000143
Length: 100, dtype: float64

In [170]:
print(task_4.loc[(task_4 < 2.6) & (task_4.index % 2 == 1)].sum())

-15.150748101821666

In [171]:
print(task_4.loc[task_4 < 0].count())

51

### Информация для последующих заданий
- Для всех последующих заданий будем использовать обезличенные транзакционные банковские данные. Для этого считайте в переменные tr_mcc_codes, tr_types, transactions и gender_train из одноимённых таблиц из папки data. Для таблицы transactions используйте только первые n=1000000 строк. Обратите внимание на разделители внутри каждого из файлов - они могут различаться!

In [128]:
### Type your code here
tr_mcc_codes = pd.read_csv("tr_mcc_codes.csv", sep=";")
tr_mcc_codes

     mcc_code                                    mcc_description
0         742                                Ветеринарные услуги
1        1711  Генеральные подрядчики по вентиляции, теплосна...
2        1731                        Подрядчики по электричеству
3        1799  Подрядчики, специализированная торговля — нигд...
4        2741           Разнообразные издательства/печатное дело
..        ...                                                ...
179      9211  Судовые выплаты, включая алименты и детскую по...
180      9222                                             Штрафы
181      9311                                  Налоговые платежи
182      9399  Правительственные услуги, нигде ранее не класс...
183      9402             Почтовые услуги — только правительство

[184 rows x 2 columns]

In [129]:
tr_types = pd.read_csv("tr_types.csv", sep=";")
tr_types

     tr_type                                     tr_description
0       3200  Плата за предоставление услуг посредством моби...
1       3210  Плата за предоставление отчета по счету карты ...
2       3800  Плата за обслуживание банковской карты (за пер...
3       4000            Плата за получение наличных в Сбербанке
4       4001  Плата за получение наличных в Сбербанке (в дру...
..       ...                                                ...
150     2990                             Списание по требованию
151     2992  Списание средств для погашения задолженности п...
152     3001            Комиссия за обслуживание ссудного счета
153     3030  Плата за обслуживание банковской карты (за пос...
154     3120                Плата за досрочный перевыпуск карты

[155 rows x 2 columns]

In [133]:
transactions = pd.read_csv("transactions.csv", nrows=1000000, sep=",")
transactions

        customer_id   tr_datetime  mcc_code  tr_type    amount   term_id
0          39026145    0 10:23:26      4814     1030  -2245.92       NaN
1          39026145    1 10:19:29      6011     7010  56147.89       NaN
2          39026145    1 10:20:56      4829     2330 -56147.89       NaN
3          39026145    1 10:39:54      5499     1010  -1392.47       NaN
4          39026145    2 15:33:42      5499     1010   -920.83       NaN
...             ...           ...       ...      ...       ...       ...
999995     98801178  269 10:29:06      5921     1010 -23016.59    127873
999996     98801178  270 10:26:45      5211     1010 -61380.88  10114209
999997     98801178  270 15:18:53      5921     1010 -11800.27  10105341
999998     98801178  271 12:47:13      5211     1010 -16170.59  10114209
999999     98801178  271 14:51:56      5921     1010 -10025.77    123991

[1000000 rows x 6 columns]

In [130]:
gender_train = pd.read_csv("gender_train.csv", sep=",")
gender_train

      customer_id  gender
0        10928546       1
1        69348468       1
2        61009479       0
3        74045822       0
4        27979606       1
...           ...     ...
8395     90417572       0
8396     66837341       0
8397     10758984       1
8398     11376556       0
8399     29190649       0

[8400 rows x 2 columns]

## Описание данных
### Таблица ```transactions.csv```
##### Описание
Таблица содержит историю транзакций клиентов банка за один год и три месяца.

##### Формат данных

```
customer_id,tr_datetime,mcc_code,tr_type,amount,term_id
111111,15 01:40:52,1111,1000,-5224,111111
111112,15 15:18:32,3333,2000,-100,11122233
...
```
##### Описание полей

 - ```customer_id``` — идентификатор клиента;
 - ```tr_datetime``` — день и время совершения транзакции (дни нумеруются с начала данных);
 - ```mcc_code``` — mcc-код транзакции;
 - ```tr_type``` — тип транзакции;
 - ```amount``` — сумма транзакции в условных единицах со знаком; ```+``` — начисление средств клиенту (приходная транзакция), ```-``` — списание средств (расходная транзакция);
 - ```term_id``` — идентификатор терминала;


### Таблица ```gender_train.csv```

##### Описание
Данная таблица содержит информацию по полу для части клиентов, для которых он известен. Для остальных клиентов пол неизвестен.

##### Формат данных
```
customer_id,gender
111111,0
111112,1
...
```

##### Описание полей
 - ```customer_id``` — идентификатор клиента;
 - ```gender``` — пол клиента;

### Таблица ```tr_mcc_codes.csv```

##### Описание
Данная таблица содержит описание mcc-кодов транзакций.

##### Формат данных
```
mcc_code;mcc_description
1000;словесное описание mcc-кода 1000
2000;словесное описание mcc-кода 2000
...
```

##### Описание полей
 - ```mcc_code``` – mcc-код транзакции;
 - ```mcc_description``` — описание mcc-кода транзакции.

### Таблица ```tr_types.csv```

##### Описание
Данная таблица содержит описание типов транзакций.

##### Формат данных
```
tr_type;tr_description
1000;словесное описание типа транзакции 1000
2000;словесное описание типа транзакции 2000
...
```

##### Описание полей
 - ```tr_type``` – тип транзакции;
 - ```tr_description``` — описание типа транзакции;

#### Task 5.
1. В tr_types выберите произвольные 100 строк с помощью метода sample (указав при этом random_seed равный 242)
2. В полученной на предыдущем этапе подвыборке найдите долю наблюдений (стобец tr_description), в которой содержится подстрока 'плата' (в любом регистре). (\*)

Выведите ответ в виде вещественного числа, округлённого до двух знаков после запятой, отделив дробную часть точкой в формате "123.45"

##### Пояснения:
(\*) Строки "ПлатА за аренду", "ПлатАза аренду", "ПЛАТА" удовлетворяют условию, так как будучи переведёнными в нижний регистр содержат подстроку "плата".

In [134]:
### Type your code here
tr_types_sample = tr_types.sample(100,random_state=242)
tr_types_sample

     tr_type                                     tr_description
37      6210                    Возврат покупки.POS Зарубеж. ТУ
50      7034  Перевод на карту/ с карты через АТМ (без взима...
145     2431  Перевод с карты на счет физ.лица в другом банк...
4       4001  Плата за получение наличных в Сбербанке (в дру...
69      8000                   Поправки по счету клиен. Зачисл.
..       ...                                                ...
24      4100                Плата за получение наличных. Россия
130     2371  Списание с карты на карту по операции <перевод...
140     2421  Перевод с карты на счет физ.лица в другом тер....
6       4011  Плата за получение наличных в АТМ Сбербанка (в...
52      7040  Перевод на карту (с карты) через POS (в предел...

[100 rows x 2 columns]

In [132]:
tr_types_sample_plata = tr_types_sample.loc[tr_types_sample['tr_description'].str.contains('плата', case=False)]
tr_types_sample_plata

    tr_type                                     tr_description
4      4001  Плата за получение наличных в Сбербанке (в дру...
5      4010        Плата за получение наличных в АТМ Сбербанка
16     4060  Плата за перевод на карту (с карты) через POS ...
30     4500                             Плата за превыш.лимита
82     8230  Плата за предоставление по запросу клиента док...
81     8220  Плата за обработку счета банковской карты клие...
23     4083           Оплата услуг банка по поручению автомат.
7      4020  Плата за получение наличных через POS в Сбербанке
8      4021  Плата за получение наличных через POS в Сберба...
1      3210  Плата за предоставление отчета по счету карты ...
15     4052  Плата за перевод на карту (с карты) через АТМ ...
80     8210                    Плата за приост. действия карты
10     4031  Плата за взнос наличных через АТМ (в другом те...
0      3200  Плата за предоставление услуг посредством моби...
2      3800  Плата за обслуживание банковской карты (за пер...
20     4080                       Оплата услуг банка через ВСП
14     4051  Плата за перевод на карту (с карты) через АТМ ...
26     4200              Плата за получение наличных. Зарубеж.
17     4061  Плата за перевод на карту (с карты) через POS ...
9      4030  Плата за взнос наличных через АТМ (в своем тер...
29     4440  Плата за получение через АТМ выписки о 10 посл...
19     4071  Плата за перевод на карту (с карты) через Моби...
18     4062  Плата за перевод на карту (с карты) через POS ...
12     4041  Плата за взнос наличных через POS (в другом те...
24     4100                Плата за получение наличных. Россия
6      4011  Плата за получение наличных в АТМ Сбербанка (в...

In [131]:
print(f"{tr_types_sample_plata.size/tr_types_sample.size:.2f}")

0.26

#### Task 6. 
1. Для поля tr_type датафрейма transactions посчитайте частоту встречаемости всех типов транзакций tr_type в transactions.
2. Из перечисленных вариантов выберите те, которые попали в топ-5 транзакций по частоте встречаемости.

#### Выберите все верные пункты:
    - 1) Выдача наличных в АТМ Сбербанк России
    - 2) Комиссия за обслуживание ссудного счета
    - 3) Списание по требованию	
    - 4) Оплата услуги. Банкоматы СБ РФ
    - 5) Погашение кредита (в пределах одного филиала)
    - 6) Покупка. POS ТУ СБ РФ

In [135]:
### Type your code here
top_5 = transactions["tr_type"].value_counts()[:5]
top_5

tr_type
1010    231117
2010    151166
7070    149006
1110    137658
1030    118975
Name: count, dtype: int64

In [136]:
tr_types[tr_types['tr_type'].isin(top_5.index)]

     tr_type                                     tr_description
59      7070  Перевод на карту (с карты) через Мобильный бан...
98      1010                              Покупка. POS ТУ СБ РФ
99      1030                     Оплата услуги. Банкоматы СБ РФ
101     1110                             Покупка. POS ТУ Россия
106     2010              Выдача наличных в АТМ Сбербанк России

In [139]:
print("Ответы 1) 4) 6)")

Ответы 1) 4) 6)

#### Task 7.
1. В датафрейме transactions задайте столбец  customer_id в качестве индекса.
2. Выделите клиента с максимальной суммой транзакции (то есть с максимальным приходом на карту). (\*)
3. Найдите у него наиболее часто встречающийся модуль суммы приходов/расходов. (\**)


#### Выберите все верные пункты:
    - 1) 1122957.89
    - 2) 15721.41
    - 3) 22459.16
    - 4) 13475494.63
    - 5) 107407.78
    - 6) 65019.26

##### Пояснения:
(\*) Если у клиента были транзакции [-10000, 10, 0, -10], то максимумом будет являться значение 10. <br>
(\**) Если у клиента были транзакции [-10000, 10, 0, -10], то наиболее встречающийся модуль суммы транзакций равен 10, и встретился он 2 раза.

In [137]:
### Type your code here
transactions.set_index('customer_id', inplace=True)
transactions

              tr_datetime  mcc_code  tr_type    amount   term_id
customer_id
39026145       0 10:23:26      4814     1030  -2245.92       NaN
39026145       1 10:19:29      6011     7010  56147.89       NaN
39026145       1 10:20:56      4829     2330 -56147.89       NaN
39026145       1 10:39:54      5499     1010  -1392.47       NaN
39026145       2 15:33:42      5499     1010   -920.83       NaN
...                   ...       ...      ...       ...       ...
98801178     269 10:29:06      5921     1010 -23016.59    127873
98801178     270 10:26:45      5211     1010 -61380.88  10114209
98801178     270 15:18:53      5921     1010 -11800.27  10105341
98801178     271 12:47:13      5211     1010 -16170.59  10114209
98801178     271 14:51:56      5921     1010 -10025.77    123991

[1000000 rows x 5 columns]

In [147]:
transactions.groupby([transactions.index.get_level_values(0)])['amount'].sum().sort_values(ascending=False)

customer_id
95481247    5.050888e+07
82235884    3.099943e+07
35497384    2.794522e+07
14937933    2.711242e+07
72908719    2.687120e+07
                ...
40917212   -1.798514e+08
42863380   -2.004481e+08
19950741   -5.626338e+08
6898820    -7.342493e+08
54871257   -8.010260e+08
Name: amount, Length: 1892, dtype: float64

In [148]:
transactions['amount'].sort_values(ascending=False)

customer_id
26782922    1.459845e+08
19950741    1.347549e+08
82581973    6.737747e+07
40917212    6.737747e+07
77695202    6.123489e+07
                ...
19950741   -5.176836e+07
77695202   -6.094944e+07
40917212   -6.737747e+07
19950741   -1.347549e+08
26782922   -1.459845e+08
Name: amount, Length: 1000000, dtype: float64

In [149]:
transactions[transactions.index == 26782922]["amount"].abs().value_counts()

amount
22459.16      25
15721.41      12
4491831.54     7
1122957.89     6
3368873.66     5
              ..
911.84         1
988202.94      1
80852.97       1
10488.43       1
116787.62      1
Name: count, Length: 216, dtype: int64

#### Task 8.
1. Найдите максимальную разницу между медианами суммы транзакций, посчитанными при заданных ниже условиях по полю amount из таблицы transactions (\*):
    - Медиана суммы транзакций
    - Медиана суммы транзакций по тем строкам, которые ни в одном из своих столбцов не содержат пустые значения
    - Медиана суммы транзакций по строкам, отсортированным по полю amount в порядке возрастания, и из которых удалены дублирующиеся по столбцам [mcc_code, tr_type] строки, причём при удалении соответстующих дублей остаются только последние из дублирующихся строк (keep='last')

Выведите ответ в виде вещественного числа, округлённого до двух знаков после запятой, отделив дробную часть точкой в формате "123.45"

##### Пояснения:
(\*) Для вычисления максимальной разницы между значениями списка можно использовать функцию np.ptp  
(\**) Если в результате получились значения [1,3,5], то макимальная разница между ними 4 == 5-1.

In [166]:
### Type your code here
# med1 = transactions.groupby([transactions.index.get_level_values(0)])["amount"].median().sort_values(ascending=False)
med1 = transactions["amount"].median()
med1

np.float64(-5614.79)

In [167]:
med2 = transactions.dropna()["amount"].median()
med2

np.float64(-5596.6)

In [165]:
med3 = transactions.sort_values("amount").drop_duplicates(["mcc_code", "tr_type"], keep="last")["amount"].median()
med3

np.float64(-920.83)

In [169]:
print("Максимальная разница между мединами сумм транзакций")
print(f"{np.ptp([med1,med2,med3]):.2f}")

Максимальная разница между мединами сумм транзакций
4693.96